bases/Wim_Mo/projects/IMDEV-8665_Retail_MV/Расширения/MV_WAP/Documents/РасчетРыночнойСтоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасчетРыночнойСтоимости</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Мандат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мандаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

bases/Wim_Mo/projects/IMDEV-8665_Retail_MV/Расширения/MV_WAP/Documents/РасчетРыночнойСтоимости/Ext/ObjectModule.bsl
#Область IMDEV_8665_MV

// IMDEV-8665 Универсальная функция — Заменяет "= &Мандат" на " В (&Мандат)", но не трогает &МандатДляКотировки и т.п.
Функция ЗаменитьМандатНаВ(Знач Текст)
	
	RegExp = Неопределено;
	
	Если Не ДополнительныеСвойства.Свойство("RegExpМандат", RegExp) Тогда
		ИнициализироватьRegExpМандат();
		RegExp = ДополнительныеСвойства["RegExpМандат"];
	КонецЕсли;
	
	Возврат RegExp.Replace(Текст, "$1 В (&Мандат)");
	
КонецФункции

// IMDEV-8665 Универсальная функция — Заменяет "= &Мандат" на " В (&Мандат)", но не трогает &МандатДляКотировки и т.п.
// Процедура инициализации RegExp (вызвать один раз)
//
Процедура ИнициализироватьRegExpМандат() Экспорт
	
	Если ДополнительныеСвойства.Свойство("RegExpМандат") Тогда
		Возврат;
	КонецЕсли;
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	
	RegExp.Global     = Истина;
	RegExp.MultiLine  = Истина;
	RegExp.IgnoreCase = Ложь;
	RegExp.Pattern    = "(=|\s)\s*&Мандат\b(?![\wА-Яа-я])";
	
	ДополнительныеСвойства.Вставить("RegExpМандат", RegExp);
	
КонецПроцедуры

// IMDEV-8665 Универсальная функция — используется во всех процедурах заполнения
Функция ОпределитьМножествоМандатов()
	
	Если ДополнительныеСвойства.Свойство("МассивМандатов")
		И ЗначениеЗаполнено(ДополнительныеСвойства.МассивМандатов) Тогда
		Возврат ДополнительныеСвойства.МассивМандатов;
	КонецЕсли;
	
	Возврат Мандат; // обычный режим (один мандат)
	
КонецФункции

// IMDEV-8665 Строит быстрый индекс по мандатам (вызывается один раз после ПерезаполнитьВсеТЧ)
Процедура ПостроитьИндексПоМандатам() Экспорт
	
	Если ДополнительныеСвойства.Свойство("ИндексМандатов") Тогда
		Возврат;
	КонецЕсли;
	
	Индекс = Новый Соответствие;
	
	Для Каждого МетаданныеТЧ Из Метаданные().ТабличныеЧасти Цикл
		
		Если МетаданныеТЧ.Реквизиты.Найти("СчетМандата") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТЧ = МетаданныеТЧ.Имя;
		ТЧ = ЭтотОбъект[ИмяТЧ];
		
		Если ТЧ.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВремИндекс = Новый Соответствие;
		
		Для Каждого Стр Из ТЧ Цикл
			Если ЗначениеЗаполнено(Стр.СчетМандата) Тогда
				Мандат = Стр.СчетМандата.Владелец;
				Если ВремИндекс[Мандат] = Неопределено Тогда
					ВремИндекс[Мандат] = Новый Массив;
				КонецЕсли;
				ВремИндекс[Мандат].Добавить(Стр);
			КонецЕсли;
		КонецЦикла;
		
		// Формируем готовые таблицы значений
		Для Каждого КЗ Из ВремИндекс Цикл
			Ключ = ИмяТЧ + "_" + Строка(КЗ.Ключ.УникальныйИдентификатор());
			Индекс[Ключ] = ТЧ.Выгрузить(КЗ.Значение);
		КонецЦикла;
		
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ИндексМандатов", Индекс);
	
КонецПроцедуры

// IMDEV-8665 Копирует данные по одному мандату из служебного документа в обычный
Процедура КопироватьПоМандату(Служебный, Док, Мандат) Экспорт
	
	Индекс = Служебный.ДополнительныеСвойства.Получить("ИндексМандатов");
	Если Индекс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого МетаданныеТЧ Из Служебный.Метаданные().ТабличныеЧасти Цикл
		
		Если МетаданныеТЧ.Реквизиты.Найти("СчетМандата") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТЧ = МетаданныеТЧ.Имя;
		Ключ  = ИмяТЧ + "_" + Строка(Мандат.УникальныйИдентификатор());
		
		Данные = Индекс.Получить(Ключ);
		
		Док[ИмяТЧ].Очистить();
		Если Данные <> Неопределено Тогда
			Док[ИмяТЧ].Загрузить(Данные);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&ИзменениеИКонтроль("ЗаполнитьТЧНКД")
Процедура MV_WAP_ЗаполнитьТЧНКД(Пересчитывать, СчетМандата, ПараметрыСборкиПакета)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЦенныеБумагиОстатки.Мандат КАК Мандат,
	|	ЦенныеБумагиОстатки.СчетМандата КАК СчетМандата,
	|	ЦенныеБумагиОстатки.Актив КАК Актив,
	|	ЦенныеБумагиОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВтЦенныеБумаги_НКД
	|ИЗ
	|	РегистрНакопления.ЦенныеБумаги.Остатки(
	|			&ДатаОстатков,
	|			Мандат = &Мандат
	|				И СчетМандата = &СчетМандата) КАК ЦенныеБумагиОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Мандат,
	|	Актив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
#Удаление
	|	&Мандат КАК Мандат,
#КонецУдаления
	|	ЗафиксированныеКотировкиСрезПоследних.Актив КАК Актив,
	|	ЗафиксированныеКотировкиСрезПоследних.НКД КАК НКД,
	|	ЗафиксированныеКотировкиСрезПоследних.ВалютаНКД КАК Валюта,
	|	ЗафиксированныеКотировкиСрезПоследних.Биржа
	|ПОМЕСТИТЬ ВтЗафиксированныеКотировки_НКД
	|ИЗ
	|	РегистрСведений.ЗафиксированныеКотировки.СрезПоследних(
	|			&ДатаОстатков,
	|			Мандат = &МандатДляКотировки
	|				И НКД <> 0) КАК ЗафиксированныеКотировкиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Мандат,
	|	Актив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЦенныеБумаги.СчетМандата КАК СчетМандата,
	|	ВтЦенныеБумаги.Актив КАК Актив,
	//IMAPPS-20570{
	//|    ВтЗафиксированныеКотировки.Валюта
	|	ВЫБОР
	//IMAPPS-24398 Добавил расчетную биржу+
	|		КОГДА ВтЗафиксированныеКотировки.Биржа = &ММВБ ИЛИ ВтЗафиксированныеКотировки.Биржа = &РасчетнаяПлан ИЛИ ВтЦенныеБумаги.Мандат.ТипМандата В (&ТипыЗПИФ)
	//IMAPPS-24398 Добавил расчетную биржу-
	|			ТОГДА ВтЗафиксированныеКотировки.Валюта
	|		ИНАЧЕ ЕСТЬNULL(ВтЗафиксированныеКотировки.Актив.Объект.ВалютаНоминальнойСтоимости, ВтЗафиксированныеКотировки.Валюта)
	|	КОНЕЦ КАК Валюта,
	//}IMAPPS-20570
	|	СУММА(ВтЦенныеБумаги.КоличествоОстаток * ВЫБОР
	|			КОГДА ДоходыКПолучениюОбороты.СуммаПриход ЕСТЬ NULL
	|				ТОГДА ВтЗафиксированныеКотировки.НКД
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма
	|ИЗ
	|	ВтЦенныеБумаги_НКД КАК ВтЦенныеБумаги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтЗафиксированныеКотировки_НКД КАК ВтЗафиксированныеКотировки
#Удаление
	|		ПО ВтЦенныеБумаги.Мандат = ВтЗафиксированныеКотировки.Мандат
	|			И ВтЦенныеБумаги.Актив = ВтЗафиксированныеКотировки.Актив
#КонецУдаления
#Вставка
	|		ПО ВтЦенныеБумаги.Актив = ВтЗафиксированныеКотировки.Актив
#КонецВставки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДоходыКПолучению.Обороты(НАЧАЛОПЕРИОДА(&ДатаОборотов, ДЕНЬ), КОНЕЦПЕРИОДА(&ДатаОборотов, ДЕНЬ), , Мандат = &Мандат) КАК ДоходыКПолучениюОбороты
	|		ПО ВтЦенныеБумаги.Актив = ДоходыКПолучениюОбороты.Актив
	|			И (ДоходыКПолучениюОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыДоходов.ПогашениеКупона))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЦенныеБумаги.Актив,
	|	ВтЦенныеБумаги.СчетМандата,
	|	ВЫБОР
	//IMAPPS-24398 Добавил расчетную биржу+
	|		КОГДА ВтЗафиксированныеКотировки.Биржа = &ММВБ ИЛИ ВтЗафиксированныеКотировки.Биржа = &РасчетнаяПлан ИЛИ ВтЦенныеБумаги.Мандат.ТипМандата В (&ТипыЗПИФ)
	//IMAPPS-24398 Добавил расчетную биржу-
	|			ТОГДА ВтЗафиксированныеКотировки.Валюта
	|		ИНАЧЕ ЕСТЬNULL(ВтЗафиксированныеКотировки.Актив.Объект.ВалютаНоминальнойСтоимости, ВтЗафиксированныеКотировки.Валюта)
	|	КОНЕЦ";


	Если СборкаПакета(ПараметрыСборкиПакета, НКД, ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли; 

	ЗаполнитьТабличнуюЧасть_Служебная(НКД, ТекстЗапроса, Пересчитывать, СчетМандата);

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьТЧПлановыйНКД")
Процедура MV_WAP_ЗаполнитьТЧПлановыйНКД(Пересчитывать, СчетМандата, ПараметрыСборкиПакета, МенеджерВременныхТаблиц)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПлановаяПозицияПоЦеннымБумагамОстатки.Мандат КАК Мандат,
	|	ПлановаяПозицияПоЦеннымБумагамОстатки.СчетМандата КАК СчетМандата,
	|	ПлановаяПозицияПоЦеннымБумагамОстатки.Актив КАК Актив,
	|	ПлановаяПозицияПоЦеннымБумагамОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ ВтЦенныеБумаги
	|ИЗ
	|	РегистрНакопления.ПлановаяПозицияПоЦеннымБумагам.Остатки(
	|			&ДатаОстатков,
	|			Мандат = &Мандат
	|				И СчетМандата = &СчетМандата) КАК ПлановаяПозицияПоЦеннымБумагамОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Мандат,
	|	Актив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
#Удаление
	|	&Мандат КАК Мандат,
#КонецУдаления
	|	ЗафиксированныеКотировкиСрезПоследних.Актив КАК Актив,
	|	ЗафиксированныеКотировкиСрезПоследних.НКД КАК НКД,
	//IMAPPS-18592++
	//|	ЗафиксированныеКотировкиСрезПоследних.ВалютаУУ КАК Валюта
	|	Выбор Когда ЗафиксированныеКотировкиСрезПоследних.ВалютаНКД <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) Тогда
	|		ЗафиксированныеКотировкиСрезПоследних.ВалютаНКД
	|	Иначе ЗафиксированныеКотировкиСрезПоследних.ВалютаУУ
	|   Конец как Валюта
	//IMAPPS-18592--
	|ПОМЕСТИТЬ ВтЗафиксированныеКотировки
	|ИЗ
	|	РегистрСведений.ЗафиксированныеКотировки.СрезПоследних(&ДатаОстатков, Мандат = &МандатДляКотировки) КАК ЗафиксированныеКотировкиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Мандат,
	|	Актив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЦенныеБумаги.СчетМандата,
	|	ВтЦенныеБумаги.Актив,
	|	ВтЗафиксированныеКотировки.Валюта,
	|	ВЫБОР
	|		КОГДА ВтЗафиксированныеКотировки.НКД ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроблемныйАктив,
	|	СУММА(ВтЦенныеБумаги.КоличествоОстаток) КАК Остаток,
	|	СУММА(ВтЦенныеБумаги.КоличествоОстаток * ЕСТЬNULL(ВтЗафиксированныеКотировки.НКД, 0)) КАК Сумма
	|ПОМЕСТИТЬ ВТ_АктивыСЗафиксированнымиКотировками
	|ИЗ
	|	ВтЦенныеБумаги КАК ВтЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЗафиксированныеКотировки КАК ВтЗафиксированныеКотировки
#Удаление
	|		ПО ВтЦенныеБумаги.Мандат = ВтЗафиксированныеКотировки.Мандат
	|			И ВтЦенныеБумаги.Актив = ВтЗафиксированныеКотировки.Актив
#КонецУдаления
#Вставка
	|		ПО ВтЦенныеБумаги.Актив = ВтЗафиксированныеКотировки.Актив
#КонецВставки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЦенныеБумаги.Актив,
	|	ВтЦенныеБумаги.СчетМандата,
	|	ВЫБОР
	|		КОГДА ВтЗафиксированныеКотировки.НКД ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВтЗафиксированныеКотировки.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КотировкиЦБНаБирже.Период,
	|	КотировкиЦБНаБирже.Актив,
	|	КотировкиЦБНаБирже.Биржа,
	|	ВЫБОР
	|		КОГДА КотировкиЦБНаБирже.Биржа.Иностранная
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет,
	|	КотировкиЦБНаБирже.НКД,
	|	КотировкиЦБНаБирже.Валюта
	|ПОМЕСТИТЬ ВТ_КотировкиНаБирже
	|ИЗ
	|	РегистрСведений.КотировкиЦБНаБирже КАК КотировкиЦБНаБирже
	|ГДЕ
	|	КотировкиЦБНаБирже.Период <= &ДатаСреза
	|	И КотировкиЦБНаБирже.Актив В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				АктивыСЗафиксированнымиКотировками.Актив
	|			ИЗ
	|				ВТ_АктивыСЗафиксированнымиКотировками КАК АктивыСЗафиксированнымиКотировками
	|			ГДЕ
	|				АктивыСЗафиксированнымиКотировками.ПроблемныйАктив)
	|	И КотировкиЦБНаБирже.НКД <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КотировкиНаБирже.Актив КАК Актив,
	|	МАКСИМУМ(ВТ_КотировкиНаБирже.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_МаксимальныеПериодыПоАктивам
	|ИЗ
	|	ВТ_КотировкиНаБирже КАК ВТ_КотировкиНаБирже
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КотировкиНаБирже.Актив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КотировкиНаБирже.Период,
	|	ВТ_КотировкиНаБирже.Актив КАК Актив,
	|	ВТ_КотировкиНаБирже.Биржа КАК Биржа,
	|	ВТ_КотировкиНаБирже.Приоритет,
	|	ВТ_КотировкиНаБирже.НКД,
	|	ВТ_КотировкиНаБирже.Валюта
	|ПОМЕСТИТЬ ВТ_ОтфильтрованныеКотировкиНаБирже
	|ИЗ
	|	ВТ_МаксимальныеПериодыПоАктивам КАК ВТ_МаксимальныеПериодыПоАктивам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотировкиНаБирже КАК ВТ_КотировкиНаБирже
	|		ПО ВТ_МаксимальныеПериодыПоАктивам.Актив = ВТ_КотировкиНаБирже.Актив
	|			И ВТ_МаксимальныеПериодыПоАктивам.Период = ВТ_КотировкиНаБирже.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОтфильтрованныеКотировкиНаБирже.Актив КАК Актив,
	|	МАКСИМУМ(ВТ_ОтфильтрованныеКотировкиНаБирже.Биржа) КАК Биржа,
	|	МИНИМУМ(ВТ_ОтфильтрованныеКотировкиНаБирже.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_РоссийскиеИИностранныеБиржиПоАктивам
	|ИЗ
	|	ВТ_ОтфильтрованныеКотировкиНаБирже КАК ВТ_ОтфильтрованныеКотировкиНаБирже
	|ГДЕ
	|	ВТ_ОтфильтрованныеКотировкиНаБирже.Приоритет = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОтфильтрованныеКотировкиНаБирже.Актив
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОтфильтрованныеКотировкиНаБирже.Актив,
	|	МАКСИМУМ(ВТ_ОтфильтрованныеКотировкиНаБирже.Биржа),
	|	МИНИМУМ(ВТ_ОтфильтрованныеКотировкиНаБирже.Приоритет)
	|ИЗ
	|	ВТ_ОтфильтрованныеКотировкиНаБирже КАК ВТ_ОтфильтрованныеКотировкиНаБирже
	|ГДЕ
	|	ВТ_ОтфильтрованныеКотировкиНаБирже.Приоритет = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОтфильтрованныеКотировкиНаБирже.Актив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РоссийскиеИИностранныеБиржиПоАктивам.Актив КАК Актив,
	|	МИНИМУМ(ВТ_РоссийскиеИИностранныеБиржиПоАктивам.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_МинимальныеПриоритеты
	|ИЗ
	|	ВТ_РоссийскиеИИностранныеБиржиПоАктивам КАК ВТ_РоссийскиеИИностранныеБиржиПоАктивам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РоссийскиеИИностранныеБиржиПоАктивам.Актив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РоссийскиеИИностранныеБиржиПоАктивам.Актив КАК Актив,
	|	ВТ_РоссийскиеИИностранныеБиржиПоАктивам.Биржа КАК Биржа,
	|	ВТ_РоссийскиеИИностранныеБиржиПоАктивам.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_БиржиПоАктивам
	|ИЗ
	|	ВТ_МинимальныеПриоритеты КАК ВТ_МинимальныеПриоритеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РоссийскиеИИностранныеБиржиПоАктивам КАК ВТ_РоссийскиеИИностранныеБиржиПоАктивам
	|		ПО ВТ_МинимальныеПриоритеты.Актив = ВТ_РоссийскиеИИностранныеБиржиПоАктивам.Актив
	|			И ВТ_МинимальныеПриоритеты.Приоритет = ВТ_РоссийскиеИИностранныеБиржиПоАктивам.Приоритет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОтфильтрованныеКотировкиНаБирже.Актив КАК Актив,
	|	ВТ_ОтфильтрованныеКотировкиНаБирже.НКД,
	|	ВТ_ОтфильтрованныеКотировкиНаБирже.Валюта
	|ПОМЕСТИТЬ ВТ_КотировкиЦБПоАктивам
	|ИЗ
	|	ВТ_БиржиПоАктивам КАК ВТ_БиржиПоАктивам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОтфильтрованныеКотировкиНаБирже КАК ВТ_ОтфильтрованныеКотировкиНаБирже
	|		ПО ВТ_БиржиПоАктивам.Актив = ВТ_ОтфильтрованныеКотировкиНаБирже.Актив
	|			И ВТ_БиржиПоАктивам.Биржа = ВТ_ОтфильтрованныеКотировкиНаБирже.Биржа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктивыСЗафиксированнымиКотировками.СчетМандата,
	|	ВТ_АктивыСЗафиксированнымиКотировками.Актив,
	|	ВТ_АктивыСЗафиксированнымиКотировками.Валюта,
	|	ВТ_АктивыСЗафиксированнымиКотировками.Сумма
	|ИЗ
	|	ВТ_АктивыСЗафиксированнымиКотировками КАК ВТ_АктивыСЗафиксированнымиКотировками
	|ГДЕ
	|	НЕ ВТ_АктивыСЗафиксированнымиКотировками.ПроблемныйАктив
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_АктивыСЗафиксированнымиКотировками.СчетМандата,
	|	ВТ_АктивыСЗафиксированнымиКотировками.Актив,
	|	ВТ_КотировкиЦБПоАктивам.Валюта,
	|	ВТ_АктивыСЗафиксированнымиКотировками.Остаток * ВТ_КотировкиЦБПоАктивам.НКД
	|ИЗ
	|	ВТ_АктивыСЗафиксированнымиКотировками КАК ВТ_АктивыСЗафиксированнымиКотировками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотировкиЦБПоАктивам КАК ВТ_КотировкиЦБПоАктивам
	|		ПО ВТ_АктивыСЗафиксированнымиКотировками.Актив = ВТ_КотировкиЦБПоАктивам.Актив
	|ГДЕ
	|	ВТ_АктивыСЗафиксированнымиКотировками.ПроблемныйАктив";

	Если СборкаПакета(ПараметрыСборкиПакета, ПлановыйНКД, ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли; 

	ЗаполнитьТабличнуюЧасть_Служебная(ПлановыйНКД, ТекстЗапроса, Пересчитывать, СчетМандата);

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьТабличнуюЧасть_Служебная")
Процедура MV_WAP_ЗаполнитьТабличнуюЧасть_Служебная(ТабличныеЧасти, ТекстЗапроса, Пересчитывать, СчетМандата)

	ОбработкаПакета = Ложь; //MID-38

	Запрос = Новый Запрос;
#Удаление
	Запрос.Текст = ТекстЗапроса;
#КонецУдаления
#Вставка
	Запрос.Текст = ЗаменитьМандатНаВ(ТекстЗапроса);
#КонецВставки
	//IMAPPS-20570{
	ТипыЗПИФ = Новый массив;
	ТипыЗПИФ.Добавить(Перечисления.ТипыМандата.M);
	ТипыЗПИФ.Добавить(Перечисления.ТипыМандата.H);
	ТипыЗПИФ.Добавить(Перечисления.ТипыМандата.Y);
	ТипыЗПИФ.Добавить(Перечисления.ТипыМандата.Q); 
	ТипыЗПИФ.Добавить(Перечисления.ТипыМандата.V);
	ТипыЗПИФ.Добавить(Перечисления.ТипыМандата.O);
	ТипыЗПИФ.Добавить(Перечисления.ТипыМандата.A); 
	ТипыЗПИФ.Добавить(Перечисления.ТипыМандата.X);
	Запрос.УстановитьПараметр("ТипыЗПИФ", ТипыЗПИФ);
	//}IMAPPS-20570

	МандатДляКотировки = ВТБ_АлгоритмыРасчета.МандатРозничноеДУ(Мандат);
	Запрос.УстановитьПараметр("МандатДляКотировки", МандатДляКотировки);
#Удаление
	Запрос.УстановитьПараметр("Мандат", Мандат);
#КонецУдаления
#Вставка
	Запрос.УстановитьПараметр("Мандат", ОпределитьМножествоМандатов());
#КонецВставки
	Запрос.УстановитьПараметр("ДатаСреза", КонецДня(Дата)); //MID-177
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));//VTB-707
	Запрос.УстановитьПараметр("ДатаОборотов", Дата);
	Запрос.УстановитьПараметр("ММВБ", Справочники.Биржи.ПолучитьСсылку(Новый УникальныйИдентификатор("a778ebdd-0acd-11e5-8de2-7071bc6f4530"))); //IMAPPS-20570
	Запрос.УстановитьПараметр("РасчетнаяПлан", Справочники.Биржи.ПолучитьСсылку(Новый УникальныйИдентификатор("c0087efb-67d7-11e7-b34e-005056b100fc"))); //IMAPPS-24398 Добавил расчетную биржу-


	Если НЕ ЗначениеЗаполнено(СчетМандата) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СчетМандата = &СчетМандата", ""); 
	Иначе
		Запрос.УстановитьПараметр("СчетМандата", СчетМандата);
	КонецЕсли; 	

	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Расчет рыночной стоимости: ЗаполнитьТабличнуюЧасть_Служебная");

	Если ТипЗнч(ТабличныеЧасти) = Тип("Массив") Тогда //Пришел пакет
		Результат 			  = Запрос.ВыполнитьПакет();
		МассивТабличныхЧастей = ТабличныеЧасти;
		ОбработкаПакета 	  = Истина;
	Иначе
		Результат = Новый Массив;
		МассивТабличныхЧастей = Новый Массив;
		РезультатЗапроса = Запрос.Выполнить();
		Результат.Добавить(РезультатЗапроса);
		МассивТабличныхЧастей.Добавить(ТабличныеЧасти);
	КонецЕсли; 

	Сч = 0;
	Для каждого ТабличнаяЧасть Из МассивТабличныхЧастей Цикл
	
		Если СчетМандата = Неопределено Тогда
			ТабличнаяЧасть.Очистить();
		Иначе
			врТаблица = ТабличнаяЧасть.Выгрузить();
			СтрокиУдаления = врТаблица.НайтиСтроки(Новый Структура("СчетМандата", СчетМандата)); 
			Для каждого СтрокаУдаления Из СтрокиУдаления Цикл
				врТаблица.Удалить(СтрокаУдаления);
			КонецЦикла;
			ТабличнаяЧасть.Загрузить(врТаблица);
		КонецЕсли;
		// MID-117 { запрос к НКД усложнился
		Если ТипЗнч(ТабличнаяЧасть) = Тип("ДокументТабличнаяЧасть.РасчетРыночнойСтоимости.НКД")
			И ОбработкаПакета Тогда   //MID-38
			Сч = Сч + 2;
		ИначеЕсли ТипЗнч(ТабличнаяЧасть) = Тип("ДокументТабличнаяЧасть.РасчетРыночнойСтоимости.ПлановыйНКД")
			И ОбработкаПакета Тогда
			Сч = Сч + 10;
		КонецЕсли;
		// } MID-117
		Выборка = Результат[Сч].Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТабличнаяЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла; 
		
		КэшКурсов = Новый Соответствие;
		
		Для каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
			Если СчетМандата <> Неопределено
				И СтрокаТЧ.СчетМандата <> СчетМандата Тогда // пересчитаем выборочно
				Продолжить;
			КонецЕсли; 
			Если ЗначениеЗаполнено(СтрокаТЧ.Валюта) Тогда
				Если КэшКурсов.Получить(СтрокаТЧ.Валюта) = Неопределено Тогда
					КэшКурсов.Вставить(СтрокаТЧ.Валюта, РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрокаТЧ.Валюта, Дата));
				КонецЕсли;
#Удаление
				ПараметрыВалютыДокумента = Новый Структура("Валюта, Курс, Кратность", Валюта, Курс, Кратность); //Курс и кратность могут быть скорректированны вручную 
#КонецУдаления
#Вставка
				ВалютаДляРасчета = ?(ЗначениеЗаполнено(Валюта), Валюта, СтрокаТЧ.СчетМандата.Владелец.ВалютаМандата);
				Если Не ЗначениеЗаполнено(ВалютаДляРасчета) Тогда
					ВалютаДляРасчета = Справочники.Валюты.RUB;
				КонецЕсли;
				Если ЗначениеЗаполнено(Валюта) Тогда
					// Если валюта в шапке документа заполнена — используем Курс и Кратность из реквизитов документа
					// (они могут быть скорректированы вручную)
					КурсДляРасчета     = Курс;
					КратностьДляРасчета = Кратность;
				Иначе
					// Если валюта в шапке не заполнена — берём курс и кратность из кэша по валюте мандата
					Если КэшКурсов.Получить(ВалютаДляРасчета) = Неопределено Тогда
						КэшКурсов.Вставить(ВалютаДляРасчета, РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДляРасчета, Дата));
					КонецЕсли;
					КурсДляРасчета     = КэшКурсов[ВалютаДляРасчета].Курс;
					КратностьДляРасчета = КэшКурсов[ВалютаДляРасчета].Кратность;
				КонецЕсли;
				ПараметрыВалютыДокумента = Новый Структура("Валюта, Курс, Кратность", ВалютаДляРасчета, КурсДляРасчета, КратностьДляРасчета);				
#КонецВставки
				СтрокаТЧ.СуммаВВалютеДокумента = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТЧ.Сумма, 
													КэшКурсов.Получить(СтрокаТЧ.Валюта),
													ПараметрыВалютыДокумента);
			Иначе	
				СтрокаТЧ.СуммаВВалютеДокумента = СтрокаТЧ.Сумма;	
			КонецЕсли; 
			
		КонецЦикла; 
		Сч = Сч + 1;
	КонецЦикла; 
	
	Если Пересчитывать Тогда
		ПересчитатьДокумент();
	КонецЕсли; 
	
	
КонецПроцедуры
